<template>
  <div class="panel-aside-container">
    <div class="panel-overlay"></div>
    <aside class="panel-aside">
      <button class="hamburger-button" @click.prevent="toggle_teacher_panel">
        <div class="hamburger-line"></div>
        <div class="hamburger-line"></div>
        <div class="hamburger-line"></div>
      </button>
      <div class="panel-top panel">
        <div class="profile">
          <img
            v-if="loading == false"
            :src="'https://api.daneshkadeonline.ir/Images/Public/Admin/' + profImage"
            class="profile-image"
            alt="تصویر پروفایل ادمین"
          />
          <h2>{{ name }}</h2>
        </div>

        <svg
          class="dashed-line"
          width="100%"
          height="15"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
        >
          <line
            stroke-dasharray="10, 5"
            x1="0"
            y1="10"
            x2="350"
            y2="10"
            style="stroke: rgb(112, 112, 112)"
          ></line>
        </svg>
        <div class="panel-item-container top custom-scrollbar">
          <nuxt-link
            to="/teachers-list"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin' || role == 'Supprot'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="25"
                height="35"
                focusable="false"
                data-prefix="fas"
                data-icon="chalkboard-user"
                class="svg-inline--fa fa-chalkboard-user"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 512"
              >
                <path
                  fill="currentColor"
                  d="M592 0h-384C181.5 0 160 22.25 160 49.63V96c23.42 0 45.1 6.781 63.1 17.81V64h352v288h-64V304c0-8.838-7.164-16-16-16h-96c-8.836 0-16 7.162-16 16V352H287.3c22.07 16.48 39.54 38.5 50.76 64h253.9C618.5 416 640 393.8 640 366.4V49.63C640 22.25 618.5 0 592 0zM160 320c53.02 0 96-42.98 96-96c0-53.02-42.98-96-96-96C106.1 128 64 170.1 64 224C64 277 106.1 320 160 320zM192 352H128c-70.69 0-128 57.31-128 128c0 17.67 14.33 32 32 32h256c17.67 0 32-14.33 32-32C320 409.3 262.7 352 192 352z"
                ></path>
              </svg>
              لیست معلمان
            </div>
          </nuxt-link>
          <nuxt-link
            to="/students-list"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin' || role == 'Supprot'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="graduation-cap"
                class="svg-inline--fa fa-graduation-cap"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 512"
              >
                <path
                  fill="currentColor"
                  d="M623.1 136.9l-282.7-101.2c-13.73-4.91-28.7-4.91-42.43 0L16.05 136.9C6.438 140.4 0 149.6 0 160s6.438 19.65 16.05 23.09L76.07 204.6c-11.89 15.8-20.26 34.16-24.55 53.95C40.05 263.4 32 274.8 32 288c0 9.953 4.814 18.49 11.94 24.36l-24.83 149C17.48 471.1 25 480 34.89 480H93.11c9.887 0 17.41-8.879 15.78-18.63l-24.83-149C91.19 306.5 96 297.1 96 288c0-10.29-5.174-19.03-12.72-24.89c4.252-17.76 12.88-33.82 24.94-47.03l190.6 68.23c13.73 4.91 28.7 4.91 42.43 0l282.7-101.2C633.6 179.6 640 170.4 640 160S633.6 140.4 623.1 136.9zM351.1 314.4C341.7 318.1 330.9 320 320 320c-10.92 0-21.69-1.867-32-5.555L142.8 262.5L128 405.3C128 446.6 213.1 480 320 480c105.1 0 192-33.4 192-74.67l-14.78-142.9L351.1 314.4z"
                ></path>
              </svg>
              لیست دانشجو ها
            </div>
          </nuxt-link>
          <nuxt-link
            to="/"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="house"
                class="svg-inline--fa fa-house"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 576 512"
              >
                <path
                  fill="currentColor"
                  d="M575.8 255.5C575.8 273.5 560.8 287.6 543.8 287.6H511.8L512.5 447.7C512.5 450.5 512.3 453.1 512 455.8V472C512 494.1 494.1 512 472 512H456C454.9 512 453.8 511.1 452.7 511.9C451.3 511.1 449.9 512 448.5 512H392C369.9 512 352 494.1 352 472V384C352 366.3 337.7 352 320 352H256C238.3 352 224 366.3 224 384V472C224 494.1 206.1 512 184 512H128.1C126.6 512 125.1 511.9 123.6 511.8C122.4 511.9 121.2 512 120 512H104C81.91 512 64 494.1 64 472V360C64 359.1 64.03 358.1 64.09 357.2V287.6H32.05C14.02 287.6 0 273.5 0 255.5C0 246.5 3.004 238.5 10.01 231.5L266.4 8.016C273.4 1.002 281.4 0 288.4 0C295.4 0 303.4 2.004 309.5 7.014L564.8 231.5C572.8 238.5 576.9 246.5 575.8 255.5L575.8 255.5z"
                ></path>
              </svg>
              صفحه اصلی
            </div>
          </nuxt-link>
          <nuxt-link
            to="/main-page"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="21.012"
                height="23.907"
                viewBox="0 0 21.012 23.907"
              >
                <defs></defs>
                <g
                  id="headphones_3_"
                  data-name="headphones (3)"
                  transform="translate(-31)"
                >
                  <g id="Group_167" data-name="Group 167" transform="translate(31)">
                    <path
                      id="Path_76"
                      data-name="Path 76"
                      class="cls-1"
                      d="M41.506,0A10.518,10.518,0,0,0,31,10.506v5.7a2.1,2.1,0,0,0,2.1,2.1h.821A2.1,2.1,0,0,0,38,17.6v-5.7a2.1,2.1,0,0,0-4.082-.7H33.1a2.091,2.091,0,0,0-.7.12v-.821a9.105,9.105,0,1,1,18.21,0v.821a2.091,2.091,0,0,0-.7-.12H49.09a2.1,2.1,0,0,0-4.082.7v5.7a2.1,2.1,0,0,0,2.711,2.011A2.1,2.1,0,0,1,45.708,21.1H43.486a2.1,2.1,0,1,0,0,1.4h2.222a3.506,3.506,0,0,0,3.5-3.5v-.7h.7a2.1,2.1,0,0,0,2.1-2.1v-5.7A10.518,10.518,0,0,0,41.506,0ZM35.2,11.907a.7.7,0,1,1,1.4,0v5.7a.7.7,0,1,1-1.4,0Zm-2.1.7h.7v4.3h-.7a.7.7,0,0,1-.7-.7V13.307A.7.7,0,0,1,33.1,12.607Zm8.4,9.9a.7.7,0,1,1,.7-.7A.7.7,0,0,1,41.506,22.506Zm6.3-4.9a.7.7,0,0,1-1.4,0v-5.7a.7.7,0,0,1,1.4,0Zm2.8-1.4a.7.7,0,0,1-.7.7h-.7v-4.3h.7a.7.7,0,0,1,.7.7Z"
                      transform="translate(-31)"
                    />
                  </g>
                </g>
              </svg>
              صفحه اصلی سایت
            </div>
          </nuxt-link>
          <nuxt-link
            to="/all-transactions"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                id="coin"
                xmlns="http://www.w3.org/2000/svg"
                width="21.044"
                height="21.044"
                viewBox="0 0 21.044 21.044"
              >
                <defs>
                  <style>
                    .cls-1 {
                      fill: #212121;
                    }
                  </style>
                </defs>
                <path
                  id="Path_78"
                  data-name="Path 78"
                  class="cls-1"
                  d="M10.522,0A10.522,10.522,0,1,0,21.044,10.522,10.534,10.534,0,0,0,10.522,0Zm0,19.659a9.137,9.137,0,1,1,9.137-9.137A9.147,9.147,0,0,1,10.522,19.659Z"
                />
                <path
                  id="Path_79"
                  data-name="Path 79"
                  class="cls-1"
                  d="M76.281,34.866V30.935a1.992,1.992,0,0,1,.971.773.692.692,0,1,0,1.156-.762A3.37,3.37,0,0,0,76.281,29.5V28.4a.692.692,0,0,0-1.385,0v1.1a3.378,3.378,0,0,0,0,6.613V40.04a1.992,1.992,0,0,1-.971-.773.692.692,0,1,0-1.156.762A3.37,3.37,0,0,0,74.9,41.477v1.1a.692.692,0,0,0,1.385,0v-1.1a3.378,3.378,0,0,0,0-6.613ZM73.594,32.8a1.994,1.994,0,0,1,1.3-1.867v3.734A1.994,1.994,0,0,1,73.594,32.8Zm2.687,7.237V36.306a1.989,1.989,0,0,1,0,3.734Z"
                  transform="translate(-65.067 -24.966)"
                />
              </svg>

              لیست تراکنش ها
            </div>
          </nuxt-link>
          <nuxt-link
            to="/discount-code"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="percent"
                class="svg-inline--fa fa-percent"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 384 512"
              >
                <path
                  fill="currentColor"
                  d="M374.6 73.39c-12.5-12.5-32.75-12.5-45.25 0l-320 320c-12.5 12.5-12.5 32.75 0 45.25C15.63 444.9 23.81 448 32 448s16.38-3.125 22.62-9.375l320-320C387.1 106.1 387.1 85.89 374.6 73.39zM64 192c35.3 0 64-28.72 64-64S99.3 64.01 64 64.01S0 92.73 0 128S28.7 192 64 192zM320 320c-35.3 0-64 28.72-64 64s28.7 64 64 64s64-28.72 64-64S355.3 320 320 320z"
                ></path>
              </svg>
              کد تخفیف
            </div>
          </nuxt-link>
          <nuxt-link
            to="/main-footer"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="21.012"
                height="23.907"
                viewBox="0 0 21.012 23.907"
              >
                <defs></defs>
                <g
                  id="headphones_3_"
                  data-name="headphones (3)"
                  transform="translate(-31)"
                >
                  <g id="Group_167" data-name="Group 167" transform="translate(31)">
                    <path
                      id="Path_76"
                      data-name="Path 76"
                      class="cls-1"
                      d="M41.506,0A10.518,10.518,0,0,0,31,10.506v5.7a2.1,2.1,0,0,0,2.1,2.1h.821A2.1,2.1,0,0,0,38,17.6v-5.7a2.1,2.1,0,0,0-4.082-.7H33.1a2.091,2.091,0,0,0-.7.12v-.821a9.105,9.105,0,1,1,18.21,0v.821a2.091,2.091,0,0,0-.7-.12H49.09a2.1,2.1,0,0,0-4.082.7v5.7a2.1,2.1,0,0,0,2.711,2.011A2.1,2.1,0,0,1,45.708,21.1H43.486a2.1,2.1,0,1,0,0,1.4h2.222a3.506,3.506,0,0,0,3.5-3.5v-.7h.7a2.1,2.1,0,0,0,2.1-2.1v-5.7A10.518,10.518,0,0,0,41.506,0ZM35.2,11.907a.7.7,0,1,1,1.4,0v5.7a.7.7,0,1,1-1.4,0Zm-2.1.7h.7v4.3h-.7a.7.7,0,0,1-.7-.7V13.307A.7.7,0,0,1,33.1,12.607Zm8.4,9.9a.7.7,0,1,1,.7-.7A.7.7,0,0,1,41.506,22.506Zm6.3-4.9a.7.7,0,0,1-1.4,0v-5.7a.7.7,0,0,1,1.4,0Zm2.8-1.4a.7.7,0,0,1-.7.7h-.7v-4.3h.7a.7.7,0,0,1,.7.7Z"
                      transform="translate(-31)"
                    />
                  </g>
                </g>
              </svg>
              فوتر سایت
            </div>
          </nuxt-link>
          <nuxt-link
            to="/cooperation"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="handshake"
                class="svg-inline--fa fa-handshake"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 512"
              >
                <path
                  fill="currentColor"
                  d="M0 383.9l64 .0404c17.75 0 32-14.29 32-32.03V128.3L0 128.3V383.9zM48 320.1c8.75 0 16 7.118 16 15.99c0 8.742-7.25 15.99-16 15.99S32 344.8 32 336.1C32 327.2 39.25 320.1 48 320.1zM348.8 64c-7.941 0-15.66 2.969-21.52 8.328L228.9 162.3C228.8 162.5 228.8 162.7 228.6 162.7C212 178.3 212.3 203.2 226.5 218.7c12.75 13.1 39.38 17.62 56.13 2.75C282.8 221.3 282.9 221.3 283 221.2l79.88-73.1c6.5-5.871 16.75-5.496 22.62 1c6 6.496 5.5 16.62-1 22.62l-26.12 23.87L504 313.7c2.875 2.496 5.5 4.996 7.875 7.742V127.1c-40.98-40.96-96.48-63.88-154.4-63.88L348.8 64zM334.6 217.4l-30 27.49c-29.75 27.11-75.25 24.49-101.8-4.371C176 211.2 178.1 165.7 207.3 138.9L289.1 64H282.5C224.7 64 169.1 87.08 128.2 127.9L128 351.8l18.25 .0369l90.5 81.82c27.5 22.37 67.75 18.12 90-9.246l18.12 15.24c15.88 12.1 39.38 10.5 52.38-5.371l31.38-38.6l5.374 4.498c13.75 11 33.88 9.002 45-4.748l9.538-11.78c11.12-13.75 9.036-33.78-4.694-44.93L334.6 217.4zM544 128.4v223.6c0 17.62 14.25 32.05 31.1 32.05L640 384V128.1L544 128.4zM592 352c-8.75 0-16-7.246-16-15.99c0-8.875 7.25-15.99 16-15.99S608 327.2 608 336.1C608 344.8 600.8 352 592 352z"
                ></path>
              </svg>
              لندینگ همکاری با ما
            </div>
          </nuxt-link>
          <!-- <div class="panel-item panel-dropdown">
            <div class="dropdown-preview">
              <div class="right-section">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="22.81"
                  height="18.622"
                  viewBox="0 0 22.81 18.622"
                >
                  <defs></defs>
                  <path
                    id="speedometer"
                    class="cls-1"
                    d="M22.81,11.4a11.3,11.3,0,0,1-2.3,6.869.891.891,0,0,1-1.421-1.075A9.621,9.621,0,1,0,1.782,11.4a9.529,9.529,0,0,0,1.942,5.794A.891.891,0,0,1,2.3,18.269,11.4,11.4,0,0,1,11.405,0,11.4,11.4,0,0,1,22.81,11.4ZM17.051,6.034a.891.891,0,0,1,0,1.26l-2.9,2.9a3.118,3.118,0,1,1-1.26-1.26l2.9-2.9a.891.891,0,0,1,1.26,0ZM12.74,11.679a1.334,1.334,0,1,0-1.334,1.334A1.336,1.336,0,0,0,12.74,11.679Zm0,0"
                    transform="translate(0 0)"
                  />
                </svg>
                داشبورد
              </div>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="angle-bottom"
                width="11.545"
                height="8.921"
                viewBox="0 0 11.545 8.921"
              >
                <defs></defs>
                <g
                  id="Group_174"
                  data-name="Group 174"
                  transform="translate(1.184 7.737) rotate(-90)"
                >
                  <line
                    id="Line_16"
                    data-name="Line 16"
                    class="cls-1 angle-bottom-line"
                    x1="8"
                    transform="matrix(-0.819, 0.574, -0.574, -0.819, 6.553, 0)"
                  />
                  <line
                    id="Line_17"
                    data-name="Line 17"
                    class="cls-1 angle-bottom-line"
                    x1="8"
                    transform="matrix(-0.819, -0.574, 0.574, -0.819, 6.553, 9.177)"
                  />
                </g>
              </svg>
            </div>
            <ul class="dropdown-container">
              <li class="dropdown-item">
                <a href="">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="11.672"
                    height="5.654"
                    viewBox="0 0 11.672 5.654"
                  >
                    <g
                      id="Group_182"
                      data-name="Group 182"
                      transform="translate(-1120.538 -242.667)"
                    >
                      <g id="left-arrow" transform="translate(1120.538 242.667)">
                        <g
                          id="Group_181"
                          data-name="Group 181"
                          transform="translate(0 0)"
                        >
                          <path
                            id="Path_86"
                            data-name="Path 86"
                            d="M11.215,134.371H1.56l1.6-1.592a.456.456,0,0,0-.643-.646L.134,134.5h0a.456.456,0,0,0,0,.645h0l2.382,2.371a.456.456,0,0,0,.643-.646l-1.6-1.592h9.656a.456.456,0,1,0,0-.912Z"
                            transform="translate(0 -132)"
                            fill="#212121"
                          />
                        </g>
                      </g>
                    </g>
                  </svg>
                  دسته دو
                </a>
              </li>
              <li class="dropdown-item">
                <a href="">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="11.672"
                    height="5.654"
                    viewBox="0 0 11.672 5.654"
                  >
                    <g
                      id="Group_182"
                      data-name="Group 182"
                      transform="translate(-1120.538 -242.667)"
                    >
                      <g id="left-arrow" transform="translate(1120.538 242.667)">
                        <g
                          id="Group_181"
                          data-name="Group 181"
                          transform="translate(0 0)"
                        >
                          <path
                            id="Path_86"
                            data-name="Path 86"
                            d="M11.215,134.371H1.56l1.6-1.592a.456.456,0,0,0-.643-.646L.134,134.5h0a.456.456,0,0,0,0,.645h0l2.382,2.371a.456.456,0,0,0,.643-.646l-1.6-1.592h9.656a.456.456,0,1,0,0-.912Z"
                            transform="translate(0 -132)"
                            fill="#212121"
                          />
                        </g>
                      </g>
                    </g>
                  </svg>
                  دسته دو
                </a>
              </li>
              <li class="dropdown-item">
                <a href="">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="11.672"
                    height="5.654"
                    viewBox="0 0 11.672 5.654"
                  >
                    <g
                      id="Group_182"
                      data-name="Group 182"
                      transform="translate(-1120.538 -242.667)"
                    >
                      <g id="left-arrow" transform="translate(1120.538 242.667)">
                        <g
                          id="Group_181"
                          data-name="Group 181"
                          transform="translate(0 0)"
                        >
                          <path
                            id="Path_86"
                            data-name="Path 86"
                            d="M11.215,134.371H1.56l1.6-1.592a.456.456,0,0,0-.643-.646L.134,134.5h0a.456.456,0,0,0,0,.645h0l2.382,2.371a.456.456,0,0,0,.643-.646l-1.6-1.592h9.656a.456.456,0,1,0,0-.912Z"
                            transform="translate(0 -132)"
                            fill="#212121"
                          />
                        </g>
                      </g>
                    </g>
                  </svg>

                  دسته دو
                </a>
              </li>
              <li class="dropdown-item">
                <a href="">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="11.672"
                    height="5.654"
                    viewBox="0 0 11.672 5.654"
                  >
                    <g
                      id="Group_182"
                      data-name="Group 182"
                      transform="translate(-1120.538 -242.667)"
                    >
                      <g id="left-arrow" transform="translate(1120.538 242.667)">
                        <g
                          id="Group_181"
                          data-name="Group 181"
                          transform="translate(0 0)"
                        >
                          <path
                            id="Path_86"
                            data-name="Path 86"
                            d="M11.215,134.371H1.56l1.6-1.592a.456.456,0,0,0-.643-.646L.134,134.5h0a.456.456,0,0,0,0,.645h0l2.382,2.371a.456.456,0,0,0,.643-.646l-1.6-1.592h9.656a.456.456,0,1,0,0-.912Z"
                            transform="translate(0 -132)"
                            fill="#212121"
                          />
                        </g>
                      </g>
                    </g>
                  </svg>

                  دسته دو
                </a>
              </li>
            </ul>
          </div> -->
          <nuxt-link
            to="/add-course/add"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                width="21"
                height="33"
                aria-hidden="true"
                focusable="false"
                data-prefix="fas"
                data-icon="book"
                class="svg-inline--fa fa-book"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 448 512"
              >
                <path
                  fill="currentColor"
                  d="M448 336v-288C448 21.49 426.5 0 400 0H96C42.98 0 0 42.98 0 96v320c0 53.02 42.98 96 96 96h320c17.67 0 32-14.33 32-31.1c0-11.72-6.607-21.52-16-27.1v-81.36C441.8 362.8 448 350.2 448 336zM143.1 128h192C344.8 128 352 135.2 352 144C352 152.8 344.8 160 336 160H143.1C135.2 160 128 152.8 128 144C128 135.2 135.2 128 143.1 128zM143.1 192h192C344.8 192 352 199.2 352 208C352 216.8 344.8 224 336 224H143.1C135.2 224 128 216.8 128 208C128 199.2 135.2 192 143.1 192zM384 448H96c-17.67 0-32-14.33-32-32c0-17.67 14.33-32 32-32h288V448z"
                ></path>
              </svg>
              افزودن دوره
            </div>
          </nuxt-link>
          <nuxt-link
            to="/news-sort"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="filter"
                class="svg-inline--fa fa-filter"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 512 512"
              >
                <path
                  fill="currentColor"
                  d="M504.6 84.19L320 306.8v149.2c0 19.52-21.97 30.7-37.75 19.66l-80-55.98C195.8 415.2 192 407.8 192 400V306.8L7.375 84.19C-9.965 63.28 5.213 32 32.7 32h446.6C506.8 32 521.1 63.28 504.6 84.19z"
                ></path>
              </svg>
              دسته بندی اخبار
            </div>
          </nuxt-link>
          <nuxt-link
            to="/sort"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                focusable="false"
                width="21"
                height="33"
                data-prefix="fas"
                data-icon="list"
                class="svg-inline--fa fa-list"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 512 512"
              >
                <path
                  fill="currentColor"
                  d="M80 48h-64C7.156 48 0 55.16 0 64v64c0 8.844 7.156 16 16 16h64C88.84 144 96 136.8 96 128V64C96 55.16 88.84 48 80 48zM80 208h-64C7.156 208 0 215.2 0 224v64c0 8.844 7.156 16 16 16h64C88.84 304 96 296.8 96 288V224C96 215.2 88.84 208 80 208zM80 368h-64C7.156 368 0 375.2 0 384v64c0 8.844 7.156 16 16 16h64C88.84 464 96 456.8 96 448v-64C96 375.2 88.84 368 80 368zM192 128h288c17.67 0 32-14.33 32-31.1S497.7 64 480 64H192C174.3 64 160 78.33 160 95.1S174.3 128 192 128zM480 384H192c-17.67 0-32 14.33-32 32s14.33 32 32 32h288c17.67 0 32-14.33 32-32S497.7 384 480 384zM480 224H192C174.3 224 160 238.3 160 256s14.33 32 32 32h288c17.67 0 32-14.33 32-32S497.7 224 480 224z"
                ></path>
              </svg>
              دسته بندی ها
            </div>
          </nuxt-link>

          <nuxt-link
            to="/contact-us"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="phone"
                class="svg-inline--fa fa-phone"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 512 512"
              >
                <path
                  fill="currentColor"
                  d="M511.2 387l-23.25 100.8c-3.266 14.25-15.79 24.22-30.46 24.22C205.2 512 0 306.8 0 54.5c0-14.66 9.969-27.2 24.22-30.45l100.8-23.25C139.7-2.602 154.7 5.018 160.8 18.92l46.52 108.5c5.438 12.78 1.77 27.67-8.98 36.45L144.5 207.1c33.98 69.22 90.26 125.5 159.5 159.5l44.08-53.8c8.688-10.78 23.69-14.51 36.47-8.975l108.5 46.51C506.1 357.2 514.6 372.4 511.2 387z"
                ></path>
              </svg>
              تماس با ما
            </div>
          </nuxt-link>
          <nuxt-link
            to="/about-us"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="info"
                class="svg-inline--fa fa-info"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 192 512"
              >
                <path
                  fill="currentColor"
                  d="M160 448h-32V224c0-17.69-14.33-32-32-32L32 192c-17.67 0-32 14.31-32 32s14.33 31.1 32 31.1h32v192H32c-17.67 0-32 14.31-32 32s14.33 32 32 32h128c17.67 0 32-14.31 32-32S177.7 448 160 448zM96 128c26.51 0 48-21.49 48-48S122.5 32.01 96 32.01s-48 21.49-48 48S69.49 128 96 128z"
                ></path>
              </svg>
              درباره ما
            </div>
          </nuxt-link>
          <nuxt-link to="/add-admin" class="panel-item" v-if="role == 'SuperAdmin'">
            <div class="sidebar-links">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="25"
                height="37"
                class="svg-icon"
                style="vertical-align: middle; fill: currentColor; overflow: hidden"
                viewBox="0 0 1024 1024"
                version="1.1"
              >
                <path
                  d="M315.392 507.904c-81.92-40.96-137.216-122.88-137.216-221.184 0-135.168 110.592-245.76 245.76-245.76s245.76 110.592 245.76 245.76c0 133.12-104.448 241.664-237.568 245.76h-2.048c-202.752 0-368.64 165.888-368.64 368.64 0 12.288-8.192 20.48-20.48 20.48s-20.48-8.192-20.48-20.48c0-186.368 124.928-344.064 294.912-393.216z m108.544-16.384c112.64 0 204.8-92.16 204.8-204.8s-92.16-204.8-204.8-204.8-204.8 92.16-204.8 204.8 92.16 204.8 204.8 204.8z m561.152 135.168l4.096 10.24-49.152 59.392c-8.192 10.24-8.192 26.624 0 36.864l49.152 57.344-4.096 10.24c-10.24 28.672-24.576 57.344-45.056 79.872l-8.192 8.192-75.776-12.288c-12.288-2.048-26.624 6.144-30.72 18.432l-26.624 73.728-10.24 2.048c-38.912 8.192-77.824 8.192-116.736 0l-12.288-2.048-24.576-71.68c-4.096-12.288-18.432-20.48-30.72-18.432l-77.824 12.288-8.192-8.192c-10.24-10.24-18.432-22.528-24.576-34.816-8.192-14.336-16.384-30.72-20.48-47.104l-4.096-10.24 51.2-57.344c8.192-10.24 8.192-26.624 0-34.816l-49.152-59.392 4.096-10.24c10.24-30.72 26.624-57.344 47.104-81.92l8.192-8.192 73.728 12.288c12.288 2.048 26.624-6.144 32.768-18.432l26.624-71.68 10.24-2.048c36.864-8.192 75.776-8.192 114.688 0l12.288 2.048 24.576 69.632c4.096 12.288 18.432 22.528 32.768 20.48l75.776-10.24 8.192 8.192c10.24 12.288 18.432 22.528 24.576 36.864 6.144 10.24 12.288 26.624 18.432 40.96z m-57.344-24.576c-4.096-8.192-8.192-14.336-14.336-22.528l-53.248 6.144c-32.768 4.096-65.536-16.384-75.776-47.104L768 491.52c-24.576-4.096-49.152-4.096-73.728 0l-18.432 49.152c-10.24 30.72-45.056 51.2-77.824 45.056l-51.2-8.192c-12.288 14.336-20.48 32.768-28.672 49.152l34.816 40.96c20.48 24.576 20.48 63.488 0 88.064l-34.816 40.96c4.096 10.24 8.192 18.432 14.336 28.672 4.096 8.192 8.192 14.336 14.336 20.48l55.296-8.192c32.768-4.096 65.536 16.384 75.776 47.104l16.384 49.152c24.576 4.096 51.2 4.096 75.776 0l18.432-51.2c10.24-30.72 45.056-51.2 75.776-45.056l51.2 8.192c10.24-14.336 20.48-30.72 26.624-49.152l-32.768-38.912c-20.48-24.576-22.528-63.488-2.048-88.064l34.816-40.96c-4.096-8.192-8.192-16.384-14.336-26.624z m-196.608 204.8c-51.2 0-92.16-40.96-92.16-92.16s40.96-92.16 92.16-92.16 92.16 40.96 92.16 92.16-43.008 92.16-92.16 92.16z m0-40.96c28.672 0 51.2-22.528 51.2-51.2s-22.528-51.2-51.2-51.2-51.2 22.528-51.2 51.2 22.528 51.2 51.2 51.2z"
                />
              </svg>
              ثبت ادمین
            </div>
          </nuxt-link>
          <nuxt-link to="/manage-news" class="panel-item" v-if="role != 'Support'">
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="far"
                data-icon="newspaper"
                class="svg-inline--fa fa-newspaper"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 512 512"
              >
                <path
                  fill="currentColor"
                  d="M456 32h-304C121.1 32 96 57.13 96 88v320c0 13.22-10.77 24-24 24S48 421.2 48 408V112c0-13.25-10.75-24-24-24S0 98.75 0 112v296C0 447.7 32.3 480 72 480h352c48.53 0 88-39.47 88-88v-304C512 57.13 486.9 32 456 32zM464 392c0 22.06-17.94 40-40 40H139.9C142.5 424.5 144 416.4 144 408v-320c0-4.406 3.594-8 8-8h304c4.406 0 8 3.594 8 8V392zM264 272h-64C186.8 272 176 282.8 176 296S186.8 320 200 320h64C277.3 320 288 309.3 288 296S277.3 272 264 272zM408 272h-64C330.8 272 320 282.8 320 296S330.8 320 344 320h64c13.25 0 24-10.75 24-24S421.3 272 408 272zM264 352h-64c-13.25 0-24 10.75-24 24s10.75 24 24 24h64c13.25 0 24-10.75 24-24S277.3 352 264 352zM408 352h-64C330.8 352 320 362.8 320 376s10.75 24 24 24h64c13.25 0 24-10.75 24-24S421.3 352 408 352zM400 112h-192c-17.67 0-32 14.33-32 32v64c0 17.67 14.33 32 32 32h192c17.67 0 32-14.33 32-32v-64C432 126.3 417.7 112 400 112z"
                ></path>
              </svg>
              مدیریت اخبار
            </div>
          </nuxt-link>
          <nuxt-link
            to="/FrequentlyQuestion"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                focusable="false"
                data-prefix="fas"
                width="21"
                height="33"
                data-icon="question"
                class="svg-inline--fa fa-question"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 320 512"
              >
                <path
                  fill="currentColor"
                  d="M204.3 32.01H96c-52.94 0-96 43.06-96 96c0 17.67 14.31 31.1 32 31.1s32-14.32 32-31.1c0-17.64 14.34-32 32-32h108.3C232.8 96.01 256 119.2 256 147.8c0 19.72-10.97 37.47-30.5 47.33L127.8 252.4C117.1 258.2 112 268.7 112 280v40c0 17.67 14.31 31.99 32 31.99s32-14.32 32-31.99V298.3L256 251.3c39.47-19.75 64-59.42 64-103.5C320 83.95 268.1 32.01 204.3 32.01zM144 400c-22.09 0-40 17.91-40 40s17.91 39.1 40 39.1s40-17.9 40-39.1S166.1 400 144 400z"
                ></path>
              </svg>
              پرسش های متداول
            </div>
          </nuxt-link>
          <nuxt-link
            to="/packages-list"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                aria-hidden="true"
                width="21"
                height="33"
                focusable="false"
                data-prefix="fas"
                data-icon="file-zipper"
                class="svg-inline--fa fa-file-zipper"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 384 512"
              >
                <path
                  fill="currentColor"
                  d="M256 0v128h128L256 0zM224 128L224 0H48C21.49 0 0 21.49 0 48v416C0 490.5 21.49 512 48 512h288c26.51 0 48-21.49 48-48V160h-127.1C238.3 160 224 145.7 224 128zM96 32h64v32H96V32zM96 96h64v32H96V96zM96 160h64v32H96V160zM128.3 415.1c-40.56 0-70.76-36.45-62.83-75.45L96 224h64l30.94 116.9C198.7 379.7 168.5 415.1 128.3 415.1zM144 336h-32C103.2 336 96 343.2 96 352s7.164 16 16 16h32C152.8 368 160 360.8 160 352S152.8 336 144 336z"
                ></path>
              </svg>
              لیست درخواست پکیج
            </div> </nuxt-link
          ><nuxt-link
            to="/settlement-req"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                width="21"
                height="33"
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                version="1.1"
                id="Capa_1"
                x="0px"
                y="0px"
                viewBox="0 0 482.085 482.085"
                style="enable-background: new 0 0 482.085 482.085"
                xml:space="preserve"
              >
                <g>
                  <path
                    d="M461.271,343.312c-6.339-5.654-14.297-8.26-22.403-7.329c-13.612,1.557-31.436,5.233-50.307,9.125   c-25.482,5.256-51.83,10.69-72.004,11.951c-17.426,1.086-49.161-3.454-58.563-8.379c-6.342-3.322-9.89-7.396-11.877-10.998h39.11   c16.135,0,29.261-13.126,29.261-29.26v-22.978c0-16.134-13.126-29.259-29.261-29.259H178.02c-4.555-0.14-59.253-1.17-97.131,31.14   c-6.704,5.718-12.036,11.121-16.288,16.031c-4.498-5.621-11.41-9.232-19.153-9.232H10.5c-5.799,0-10.5,4.701-10.5,10.5V452.96   c0,2.785,1.107,5.456,3.075,7.425c1.97,1.969,4.641,3.075,7.425,3.075l34.947-0.001c13.525,0,24.528-11.003,24.528-24.527v-8.07   c10.451,0.656,34.136,3.242,84.261,12.653c59.194,11.115,96.13,14.882,125.231,14.881c20.856,0,37.691-1.934,55.801-4.485   c22.387-3.151,50.544-11.116,75.386-18.143c11.5-3.253,22.362-6.325,31.974-8.749c25.901-6.533,29.769-22.865,29.769-32.02V368.25   C472.397,358.85,468.237,349.527,461.271,343.312z M48.976,438.932c0,1.945-1.583,3.527-3.528,3.527L21,442.46V315.125h24.447   c1.945,0,3.528,1.582,3.528,3.527V438.932z M451.397,395c0,2.23,0,8.15-13.903,11.656c-9.903,2.498-20.906,5.61-32.555,8.905   c-24.198,6.845-51.625,14.603-72.598,17.555c-41.317,5.818-75.766,8.248-174.23-10.239c-50.639-9.508-75.773-12.382-88.136-13.041   v-77.961c0.375-0.469,0.722-0.968,1.021-1.513c2.69-4.908,9.323-14.949,23.521-27.059c32.373-27.613,82.42-26.142,82.913-26.125   c0.136,0.005,0.272,0.008,0.408,0.008h107.39c4.555,0,8.261,3.705,8.261,8.259v22.978c0,4.555-3.706,8.26-8.261,8.26h-107.39   c-5.799,0-10.5,4.701-10.5,10.5s4.701,10.5,10.5,10.5h45.977c2.159,8.61,8.116,21.052,24.435,29.6   c14.925,7.819,51.944,11.846,69.616,10.736c21.654-1.352,48.742-6.939,74.938-12.343c18.396-3.795,35.772-7.379,48.451-8.829   c2.672-0.302,4.756,0.993,6.037,2.137c2.532,2.259,4.106,5.811,4.106,9.268V395z"
                  />
                  <path
                    d="M455.157,18.625H86.362c-14.848,0-26.928,12.08-26.928,26.928V218.45c0,14.849,12.08,26.93,26.928,26.93h368.795   c14.848,0,26.928-12.081,26.928-26.93V45.552C482.085,30.705,470.005,18.625,455.157,18.625z M403.067,224.379H138.474   c-2.782-31.306-27.122-56.49-58.039-60.583V97.343c29.967-3.968,53.751-27.752,57.718-57.719h265.235   c3.967,29.961,27.74,53.741,57.697,57.717v66.457C430.179,167.9,405.849,193.081,403.067,224.379z M461.085,45.552v30.528   c-18.359-3.591-32.854-18.093-36.438-36.456h30.51C458.426,39.625,461.085,42.284,461.085,45.552z M86.362,39.625h30.531   c-3.584,18.37-18.089,32.875-36.459,36.46V45.552C80.435,42.284,83.094,39.625,86.362,39.625z M80.435,218.45v-33.395   c19.314,3.769,34.352,19.611,36.919,39.324H86.362C83.094,224.379,80.435,221.719,80.435,218.45z M455.157,224.379h-30.97   c2.566-19.706,17.593-35.545,36.897-39.32v33.391C461.085,221.719,458.426,224.379,455.157,224.379z"
                  />
                  <path
                    d="M271.325,56.884c-41.421,0-75.119,33.697-75.119,75.117c0,41.421,33.698,75.119,75.119,75.119   c41.42,0,75.118-33.698,75.118-75.119C346.443,90.582,312.745,56.884,271.325,56.884z M271.325,186.121   c-29.842,0-54.119-24.277-54.119-54.119c0-29.84,24.277-54.117,54.119-54.117c29.841,0,54.118,24.277,54.118,54.117   C325.443,161.843,301.166,186.121,271.325,186.121z"
                  />
                  <path
                    d="M150.439,99.705c-17.81,0-32.298,14.488-32.298,32.298c0,17.809,14.488,32.297,32.298,32.297   c17.809,0,32.297-14.488,32.297-32.297C182.736,114.193,168.248,99.705,150.439,99.705z M150.439,143.299   c-6.229,0-11.298-5.067-11.298-11.297c0-6.23,5.068-11.298,11.298-11.298c6.23,0,11.297,5.068,11.297,11.298   C161.736,138.232,156.669,143.299,150.439,143.299z"
                  />
                  <path
                    d="M392.209,99.705c-17.809,0-32.297,14.488-32.297,32.298c0,17.809,14.488,32.297,32.297,32.297   c17.81,0,32.299-14.488,32.299-32.297C424.508,114.193,410.019,99.705,392.209,99.705z M392.209,143.299   c-6.23,0-11.297-5.067-11.297-11.297c0-6.23,5.067-11.298,11.297-11.298c6.23,0,11.299,5.068,11.299,11.298   C403.508,138.232,398.44,143.299,392.209,143.299z"
                  />
                </g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
              </svg>
              درخواست تسویه مدرس
            </div>
          </nuxt-link>
          <nuxt-link
            to="/settlement-req-visitor"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                width="21"
                height="33"
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                version="1.1"
                id="Capa_1"
                x="0px"
                y="0px"
                viewBox="0 0 482.085 482.085"
                style="enable-background: new 0 0 482.085 482.085"
                xml:space="preserve"
              >
                <g>
                  <path
                    d="M461.271,343.312c-6.339-5.654-14.297-8.26-22.403-7.329c-13.612,1.557-31.436,5.233-50.307,9.125   c-25.482,5.256-51.83,10.69-72.004,11.951c-17.426,1.086-49.161-3.454-58.563-8.379c-6.342-3.322-9.89-7.396-11.877-10.998h39.11   c16.135,0,29.261-13.126,29.261-29.26v-22.978c0-16.134-13.126-29.259-29.261-29.259H178.02c-4.555-0.14-59.253-1.17-97.131,31.14   c-6.704,5.718-12.036,11.121-16.288,16.031c-4.498-5.621-11.41-9.232-19.153-9.232H10.5c-5.799,0-10.5,4.701-10.5,10.5V452.96   c0,2.785,1.107,5.456,3.075,7.425c1.97,1.969,4.641,3.075,7.425,3.075l34.947-0.001c13.525,0,24.528-11.003,24.528-24.527v-8.07   c10.451,0.656,34.136,3.242,84.261,12.653c59.194,11.115,96.13,14.882,125.231,14.881c20.856,0,37.691-1.934,55.801-4.485   c22.387-3.151,50.544-11.116,75.386-18.143c11.5-3.253,22.362-6.325,31.974-8.749c25.901-6.533,29.769-22.865,29.769-32.02V368.25   C472.397,358.85,468.237,349.527,461.271,343.312z M48.976,438.932c0,1.945-1.583,3.527-3.528,3.527L21,442.46V315.125h24.447   c1.945,0,3.528,1.582,3.528,3.527V438.932z M451.397,395c0,2.23,0,8.15-13.903,11.656c-9.903,2.498-20.906,5.61-32.555,8.905   c-24.198,6.845-51.625,14.603-72.598,17.555c-41.317,5.818-75.766,8.248-174.23-10.239c-50.639-9.508-75.773-12.382-88.136-13.041   v-77.961c0.375-0.469,0.722-0.968,1.021-1.513c2.69-4.908,9.323-14.949,23.521-27.059c32.373-27.613,82.42-26.142,82.913-26.125   c0.136,0.005,0.272,0.008,0.408,0.008h107.39c4.555,0,8.261,3.705,8.261,8.259v22.978c0,4.555-3.706,8.26-8.261,8.26h-107.39   c-5.799,0-10.5,4.701-10.5,10.5s4.701,10.5,10.5,10.5h45.977c2.159,8.61,8.116,21.052,24.435,29.6   c14.925,7.819,51.944,11.846,69.616,10.736c21.654-1.352,48.742-6.939,74.938-12.343c18.396-3.795,35.772-7.379,48.451-8.829   c2.672-0.302,4.756,0.993,6.037,2.137c2.532,2.259,4.106,5.811,4.106,9.268V395z"
                  />
                  <path
                    d="M455.157,18.625H86.362c-14.848,0-26.928,12.08-26.928,26.928V218.45c0,14.849,12.08,26.93,26.928,26.93h368.795   c14.848,0,26.928-12.081,26.928-26.93V45.552C482.085,30.705,470.005,18.625,455.157,18.625z M403.067,224.379H138.474   c-2.782-31.306-27.122-56.49-58.039-60.583V97.343c29.967-3.968,53.751-27.752,57.718-57.719h265.235   c3.967,29.961,27.74,53.741,57.697,57.717v66.457C430.179,167.9,405.849,193.081,403.067,224.379z M461.085,45.552v30.528   c-18.359-3.591-32.854-18.093-36.438-36.456h30.51C458.426,39.625,461.085,42.284,461.085,45.552z M86.362,39.625h30.531   c-3.584,18.37-18.089,32.875-36.459,36.46V45.552C80.435,42.284,83.094,39.625,86.362,39.625z M80.435,218.45v-33.395   c19.314,3.769,34.352,19.611,36.919,39.324H86.362C83.094,224.379,80.435,221.719,80.435,218.45z M455.157,224.379h-30.97   c2.566-19.706,17.593-35.545,36.897-39.32v33.391C461.085,221.719,458.426,224.379,455.157,224.379z"
                  />
                  <path
                    d="M271.325,56.884c-41.421,0-75.119,33.697-75.119,75.117c0,41.421,33.698,75.119,75.119,75.119   c41.42,0,75.118-33.698,75.118-75.119C346.443,90.582,312.745,56.884,271.325,56.884z M271.325,186.121   c-29.842,0-54.119-24.277-54.119-54.119c0-29.84,24.277-54.117,54.119-54.117c29.841,0,54.118,24.277,54.118,54.117   C325.443,161.843,301.166,186.121,271.325,186.121z"
                  />
                  <path
                    d="M150.439,99.705c-17.81,0-32.298,14.488-32.298,32.298c0,17.809,14.488,32.297,32.298,32.297   c17.809,0,32.297-14.488,32.297-32.297C182.736,114.193,168.248,99.705,150.439,99.705z M150.439,143.299   c-6.229,0-11.298-5.067-11.298-11.297c0-6.23,5.068-11.298,11.298-11.298c6.23,0,11.297,5.068,11.297,11.298   C161.736,138.232,156.669,143.299,150.439,143.299z"
                  />
                  <path
                    d="M392.209,99.705c-17.809,0-32.297,14.488-32.297,32.298c0,17.809,14.488,32.297,32.297,32.297   c17.81,0,32.299-14.488,32.299-32.297C424.508,114.193,410.019,99.705,392.209,99.705z M392.209,143.299   c-6.23,0-11.297-5.067-11.297-11.297c0-6.23,5.067-11.298,11.297-11.298c6.23,0,11.299,5.068,11.299,11.298   C403.508,138.232,398.44,143.299,392.209,143.299z"
                  />
                </g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
              </svg>
              درخواست تسویه ویزیتور
            </div>
          </nuxt-link>
          <nuxt-link
            to="/courses-list"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                width="21"
                height="33"
                aria-hidden="true"
                focusable="false"
                data-prefix="fas"
                data-icon="book"
                class="svg-inline--fa fa-book"
                role="img"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 448 512"
              >
                <path
                  fill="currentColor"
                  d="M448 336v-288C448 21.49 426.5 0 400 0H96C42.98 0 0 42.98 0 96v320c0 53.02 42.98 96 96 96h320c17.67 0 32-14.33 32-31.1c0-11.72-6.607-21.52-16-27.1v-81.36C441.8 362.8 448 350.2 448 336zM143.1 128h192C344.8 128 352 135.2 352 144C352 152.8 344.8 160 336 160H143.1C135.2 160 128 152.8 128 144C128 135.2 135.2 128 143.1 128zM143.1 192h192C344.8 192 352 199.2 352 208C352 216.8 344.8 224 336 224H143.1C135.2 224 128 216.8 128 208C128 199.2 135.2 192 143.1 192zM384 448H96c-17.67 0-32-14.33-32-32c0-17.67 14.33-32 32-32h288V448z"
                ></path>
              </svg>
              لیست دوره ها
            </div>
          </nuxt-link>
          <nuxt-link
            to="/add-teacher"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin' || role == 'Supprot'"
          >
            <div class="sidebar-links">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                width="21"
                height="33"
                version="1.1"
                id="Capa_1"
                x="0px"
                y="0px"
                viewBox="0 0 489.38 489.38"
                style="enable-background: new 0 0 489.38 489.38"
                xml:space="preserve"
              >
                <g id="XMLID_129_">
                  <path
                    id="XMLID_134_"
                    d="M473.725,5.656H213.576c-8.655,0-15.655,7.022-15.655,15.664v110.484l11.319-13.234   c5.375-6.292,12.461-10.172,19.992-11.793V36.978h228.836v204.531H229.233v-34.238l-7.05,8.244   c-6.161,7.189-14.858,11.65-24.262,12.529v29.124c0,8.642,7,15.655,15.655,15.655h84.489L255.141,467.7   c-1.923,8.739,3.6,17.382,12.346,19.31c8.667,1.904,17.382-3.601,19.287-12.331l44.457-201.855h25.844l44.457,201.855   c1.666,7.557,8.369,12.714,15.803,12.705c1.154,0,2.334-0.117,3.502-0.374c8.746-1.928,14.268-10.57,12.328-19.31l-42.92-194.877   h83.481c8.647,0,15.655-7.013,15.655-15.655V21.32C489.38,12.678,482.372,5.656,473.725,5.656z"
                  />
                  <path
                    id="XMLID_132_"
                    d="M349.368,97.116c-1.234-3.11-4.732-4.637-7.84-3.406l-92.234,32.555   c-8.465-6.554-20.678-5.383-27.737,2.827l-29.267,34.178l-25.951-22.245c0.171,1.837,0.56,3.622,0.56,5.507v48.291l14.438,12.371   c8.568,7.338,21.385,6.204,28.549-2.198l34.842-40.743l28.1-16.439l73.951-43.267C349.336,103.073,350.469,99.923,349.368,97.116z"
                  />
                  <path
                    id="XMLID_131_"
                    d="M109.928,105.776H92.547c-13.308,0-25.01,6.468-32.448,16.327l-53.352,49.12   c-8.313,7.405-9.067,20.232-1.581,28.595l43.528,48.585c7.421,8.309,20.267,9.044,28.579,1.576   c8.334-7.469,9.038-20.262,1.57-28.586l-30.003-33.504l42.616-38.134l-24.82,33.721l24.279,27.107   c13.416,14.992,12.151,38.027-2.834,51.453c-10.231,9.172-24.193,11.324-36.297,7.094c0,0,0.188,93.659,0.188,193.962   c0,13.416,10.874,24.291,24.291,24.291c13.403,0,24.291-10.875,24.291-24.291c0-100.272,0-43.051,0-144.771h16.203   c0,101.646,0,44.468,0,144.771c0,7.004-1.953,13.49-5.067,19.231c4.076,3.135,9.148,5.06,14.676,5.06   c13.424,0,24.298-10.875,24.298-24.291c0-100.272,0.031-58.237,0.031-316.561C150.697,124.022,132.45,105.776,109.928,105.776z"
                  />
                  <path
                    id="XMLID_130_"
                    d="M79.592,91.198c6.495,3.376,13.787,5.471,21.62,5.471c7.853,0,15.145-2.095,21.659-5.477   c15.204-7.877,25.684-23.559,25.684-41.862c0-26.146-21.196-47.335-47.344-47.335c-26.144,0-47.335,21.189-47.335,47.335   C53.877,67.643,64.368,83.331,79.592,91.198z"
                  />
                </g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
              </svg>
              افزودن مدرس
            </div>
          </nuxt-link>
          <nuxt-link
            to="/add-visitor"
            class="panel-item"
            v-if="role == 'SuperAdmin' || role == 'Admin'"
          >
            <div class="sidebar-links">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                version="1.1"
                width="21"
                height="33"
                id="Capa_1"
                x="0px"
                y="0px"
                viewBox="0 0 504.994 504.994"
                style="enable-background: new 0 0 504.994 504.994"
                xml:space="preserve"
              >
                <g>
                  <g>
                    <g>
                      <path
                        d="M134.386,327.995H32.917C14.862,327.995,0,344.582,0,365.01v101.793c0,20.341,14.862,36.994,32.917,36.994h101.469     c18.055,0,32.874-16.631,32.874-36.994V365.01C167.26,344.582,152.462,327.995,134.386,327.995z"
                      />
                      <circle cx="83.587" cy="254.417" r="63.246" />
                      <path
                        d="M472.12,327.995H370.672c-18.033,0-32.874,16.631-32.874,37.059v101.793c0,20.341,14.841,37.015,32.874,37.015H472.12     c18.119,0,32.874-16.631,32.874-37.015V365.053C505.015,344.582,490.239,327.995,472.12,327.995z"
                      />
                      <path
                        d="M421.342,317.662c35.031,0,63.289-28.301,63.289-63.246s-28.258-63.246-63.289-63.246     c-34.902,0-63.202,28.301-63.202,63.246C358.161,289.361,386.441,317.662,421.342,317.662z"
                      />
                      <polygon
                        points="266.723,385.049 200.328,385.049 200.328,426.249 266.723,426.249 266.723,454.593 315.667,405.628      266.723,356.727    "
                      />
                      <path
                        d="M312.323,144.772c-5.652-5.652-12.943-10.419-21.894-14.388c-4.638-2.028-14.172-4.875-28.689-8.585V39.485     c9.34,1.898,16.696,5.889,22.024,11.907c5.35,5.975,8.844,14.69,10.613,25.993l29.574-4.487     c-2.567-18.335-10.095-32.68-22.585-43.163c-9.728-8.262-22.908-13.158-39.561-14.776V1.132h-17.041v13.827     c-19.069,1.941-33.348,7.097-43.012,15.66C187.256,43.217,180.03,59.74,180.03,80.146c0,11.476,2.459,21.743,7.399,30.803     c4.983,9.017,12.015,16.049,21.226,21.183c12.295,6.903,24.353,11.885,36.109,14.884v90.166     c-11.26-1.208-20.881-6.881-28.926-17.084c-5.565-7.248-9.513-18.572-11.735-34.017l-28.991,5.544     c1.1,14.949,4.875,27.546,11.433,37.921c6.493,10.332,14.258,17.839,23.232,22.455c8.973,4.659,20.6,7.916,34.988,9.707v28.732     v0.022h16.998v-29.185c20.104-0.971,36.498-8.089,49.117-21.398c12.705-13.266,19.025-29.897,19.025-49.807     c0-9.038-1.488-17.451-4.53-25.216C322.289,157.111,317.996,150.424,312.323,144.772z M244.764,117.356     c-13.05-3.343-22.304-8.305-27.783-14.862c-5.436-6.622-8.24-14.754-8.24-24.504c0-9.901,3.236-18.421,9.664-25.626     c6.45-7.183,15.207-11.691,26.359-13.374V117.356z M289.372,222.686c-7.248,8.262-16.502,13.115-27.611,14.496v-85.787     c15.423,3.969,25.712,9.146,30.889,15.445c5.134,6.32,7.636,14.668,7.636,25.087C300.265,204.157,296.641,214.36,289.372,222.686     z"
                      />
                    </g>
                  </g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                  <g></g>
                </g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
                <g></g>
              </svg>
              افزودن ویزیتور
            </div>
          </nuxt-link>
          <nuxt-link class="panel-item" to="/tickets">
          <div class="sidebar-links">
            <svg
    xmlns="http://www.w3.org/2000/svg"
    width="21.012"
    height="23.907"
    viewBox="0 0 21.012 23.907">
        <defs></defs>
        <g id="headphones_3_" data-name="headphones (3)" transform="translate(-31)">
            <g id="Group_167" data-name="Group 167" transform="translate(31)">
                <path
                id="Path_76"
                data-name="Path 76"
                class="cls-1"
                d="M41.506,0A10.518,10.518,0,0,0,31,10.506v5.7a2.1,2.1,0,0,0,2.1,2.1h.821A2.1,2.1,0,0,0,38,17.6v-5.7a2.1,2.1,0,0,0-4.082-.7H33.1a2.091,2.091,0,0,0-.7.12v-.821a9.105,9.105,0,1,1,18.21,0v.821a2.091,2.091,0,0,0-.7-.12H49.09a2.1,2.1,0,0,0-4.082.7v5.7a2.1,2.1,0,0,0,2.711,2.011A2.1,2.1,0,0,1,45.708,21.1H43.486a2.1,2.1,0,1,0,0,1.4h2.222a3.506,3.506,0,0,0,3.5-3.5v-.7h.7a2.1,2.1,0,0,0,2.1-2.1v-5.7A10.518,10.518,0,0,0,41.506,0ZM35.2,11.907a.7.7,0,1,1,1.4,0v5.7a.7.7,0,1,1-1.4,0Zm-2.1.7h.7v4.3h-.7a.7.7,0,0,1-.7-.7V13.307A.7.7,0,0,1,33.1,12.607Zm8.4,9.9a.7.7,0,1,1,.7-.7A.7.7,0,0,1,41.506,22.506Zm6.3-4.9a.7.7,0,0,1-1.4,0v-5.7a.7.7,0,0,1,1.4,0Zm2.8-1.4a.7.7,0,0,1-.7.7h-.7v-4.3h.7a.7.7,0,0,1,.7.7Z"
                transform="translate(-31)"
                />
            </g>
        </g>
</svg>
            پشتیبانی
          </div>
        </nuxt-link>
        </div>
      </div>
    </aside>
  </div>
</template>
<script>
export default {
  data() {
    return {
      name: "",
      profImage: "",
      loading: true,
      role: "",
    };
  },
  async mounted() {
    this.loading = true;
    const token = this.$cookies.get("key");
    // if (this.$store.state.login.name != "") {
    //   this.name = this.$store.state.login.name;
    //   this.profImage = this.$store.state.login.profileImageName;
    //   this.loading = false;
    // } else {
    const getData = await this.$axios
      .post(
        "/api/Admin/AdminAccount/check-admin-auth",
        {},
        {
          headers: {
            Authorization: `Bearer ${this.$cookies.get("key")}`,
          },
        }
      )
      .catch((e) => {
        console.log(e);
      });
    // console.log(getData);
    if (getData.data.statusCode == "200") {
      const name = getData.data.data.adminName;
      const phone = getData.data.data.phoneNumber;
      this.name = name;
      this.profImage = getData.data.data.profileImageName;
      this.loading = false;
      this.role = getData.data.data.role;
    }
    // }
  },
  methods: {
    toggle_teacher_panel() {
      const panel_aside = document.querySelector(".panel-aside");
      panel_aside.classList.toggle("show");
    },
    togglePanel() {
      document.querySelector(".dropdown-preview").parentNode.classList.toggle("expanded");
    },
  },
  watch: {
    $route: {
      handler() {
        const panel_teacher_aside = document.querySelector(".panel-aside");
        if (panel_teacher_aside.classList.contains("show")) {
          panel_teacher_aside.classList.remove("show");
        }
      },
      deep: true,
    },
  },
};
</script>
<style lang="scss">
.panel-aside-container {
  display: flex;
}
</style>
